<template>
  <div class="clause">
      <pre style="word-wrap: break-word; white-space: pre-wrap;">“青学教育信息”用户服务协议

欢迎访问“青学教育信息”网站。请用户在访问和使用“青学教育信息”提供的服务前仔细阅读本协议，用户接受本协议并点击“同意该协议”按钮，即表明用户与“青学教育信息”已达成协议并接受所有服务条款。


一、 “青学教育信息”服务

用户应了解并知悉，“青学教育信息”是为教师、教育机构及学生提供教学信息发布、搜索与交流的服务平台。学生与教师、教育机构通过“青学教育信息”的平台服务，在双方之间达成独立的教学服务协议，并承担相应的权利和义务。如在教学过程中导致用户遭受相关财产及人身损害的，用户应直接向另一方追责，“青学教育信息”免于承担因学生和老师之间服务协议履行所致任何纠纷的赔偿责任。同时，“青学教育信息”建立了完善的教师、教育机构资质认证体系及客服团队，力争避免学生与教师、教育机构产生纠纷，积极帮助或促使学生、教师或教育机构妥善解决纠纷。


二、使用规则

1、注册及账户

为了使用“青学教育信息”提供的服务，用户需要注册一个“青学教育信息”账户。账户默认名即为用户所提供的常用手机号码，用户需设置密码并确认，通过“青学教育信息”下发的验证码进行账户验证后，该账户即完成初步注册。在用户中心里，用户可以设置相关个人信息。用户可以在账户中查询到自己的课程记录。

用户使用“青学教育信息”服务，应负责维护自己账户的保密性并限制第三方使用/访问其计算机或移动设备，用户对其账户和密码下发生的所有活动承担法律责任。

2、信息发布

“青学教育信息”会将教师、教育机构填写的信息（包括但不限于用户信息、教学信息、教学资讯等)公布于“青学教育信息”服务平台。“青学教育信息”认真履行注意义务，对入驻教师、教育机构的身份、资质等相关证件进行形式审核认证。

3、课程订单

本条款所述“课程订单”是指用户在“青学教育信息”平台上根据自身需求匹配达成的学生与教师（或学生与教育机构）之间的服务协议。学生在“青学教育信息”平台搜索到合适的课程后，课程预约订单在学生/家长通过“青学教育信息”已支付课程预约费用时正式成立。课程预约订单有效期内，学生/家长需按照相应教师/教育机构所声明的具体协议交付课程剩余费用，同时双方需对课程相关服务合同达成一致，并由教师/教育机构在客户端进行课程确认。超过课程预约订单有效期，视学生/家长取消该次课程预约。

4、授课及点评

学生按照教师/教育机构提供场地（或其他双方商议场地）上课。

教师/教育机构履行完毕与学生/家长达成的服务合同后，学生/家长可在客户端上做出相应的真实评价，对教师/教育机构及“青学教育信息”的服务做出反馈，以便教师/教育机构和“青学教育信息”进一步改进服务。

用户可以在“青学教育信息”平台发表对课程的评论、意见和其他相关内容，以及向平台提出建议、意见或其他信息，但是该等内容不得违反中国现行法律法规及其他规范性文件的要求，不得含有非法、淫秽、威胁、侮辱、诽谤、侵犯隐私、侵犯知识产权的内容或以其他形式对第三方权利构成的侵犯。

“青学教育信息”在接到有关权利人（学生、家长、教师及教育机构等）的投诉与举报后将采取合理的删除或屏蔽等措施。基于用户的过错给“青学教育”造成损失时，用户须对“青学教育信息”承担赔偿责任。


三、双方权利义务及法律责任

1、“青学教育信息”享有对本协议约定服务的监督、提示、检查、纠正等权利。

2、“青学教育信息”有权删除或屏蔽用户上传的非法及侵权信息。

3、“青学教育信息”谨慎使用用户的所有信息，非依法律规定及用户许可，不得向任何第三方透露用户信息。

4、“青学教育信息”为任何涉嫌侵权的权利人设置投诉与举报渠道，并依法采取合理救济措施。

5、用户须为合法目的使用 “青学教育信息”提供的平台服务。

6、用户对其发布的信息的真实性及合法性承担法律责任。用户不得在“青学教育信息”平台上发布任何虚假、违法信息及言论。用户上传“青学教育信息”的任何内容如涉嫌侵犯第三方权利的，用户须独立承担因此所产生法律责任。

7、用户依据“青学教育信息”平台提供的信息达成预约课程订单的，应在线下或线上全面、适当履行约定义务并独立承担法律责任。

8、用户仅对在“青学教育信息”上享有的服务及内容享有使用权，未经“青学教育信息”或其他第三方权利人的书面许可，用户不得对包括视频、学习软件、学习资料、音频内容等在内的任何内容进行翻录、复制、发行等违反知识产权相关法律、法规的行为，由此所导致的一切民事、行政或刑事责任，由用户自行承担。


四、用户注意义务特别提示

用户上传“青学教育信息”平台的信息不得含有以下内容：

（一）反对宪法确定的基本原则的；

（二）危害国家统一、主权和领土完整的；

（三）泄露国家秘密、危害国家安全或者损害国家荣誉和利益的；

（四）煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；

（五）宣扬邪教、迷信的；

（六）扰乱社会秩序，破坏社会稳定的；

（七）诱导未成年人违法犯罪和渲染暴力、色情、赌博、恐怖活动的；

（八）侮辱或者诽谤他人，侵害公民个人隐私等他人合法权益的；

（九）危害社会公德，损害民族优秀文化传统的；

（十）有关法律、行政法规和国家规定禁止的其他内容。



五、未成年人特别注意事项

如果用户不是具备完全民事权利能力和完全民事行为能力的自然人，请用户征得其监护人许可或由其监护人直接使用“青学教育信息”服务。后续线上线下上课、付款等所有相关事宜也需由监护人陪同或征得监护人许可完成。


六、知识产权

1、软件使用

“青学教育信息”在此授予客户免费的、不可转让的、非独占的全球性个人许可，允许客户使用由“青学教育信息”提供的、包含在服务中的软件。但是，客户不得复制、修改、发布、出售或出租“青学教育信息”的服务软件或所含软件的任何部分，也不得进行反向工程或试图提取该软件的源代码。

2、版权

“青学教育信息”所包含或提供的所有内容诸如文字、图片、视频、声音文件片段、数字下载、软件等都是“青学教育信息”或其内容提供者的财产，受中国和国际版权法的保护。“青学教育信息”上所提供使用的所有软件都是“青学教育信息”或其软件供应商的财产，受中国和国际版权法的保护。未经“青学教育信息”书面许可，不得以任何形式通过任何方式复制、展示、修改、转让、分发、重新发布、下载、张贴或传输本网站的内容。

3、企业标识

本软件服务所包含或者提供的图标、标识、网页页眉、按钮图标、文字等均为“青学教育信息”的合法企业标识。用户未经“青学教育信息”书面许可不得擅自使用，不得以任何方式或理由对本软件的标识的任何部分进行使用、复制、修改、传播或与其他产品捆绑使用，不得以任何可能引起消费者混淆的方式或任何诋毁或诽谤“青学教育信息”的方式用于任何商品或服务上。未经“青学教育信息”的书面许可，本软件上的任何内容都不应被解释为以默许或其他方式授予许可或使用本网站上出现的标识的权利。


七、免责条款

如发生以下情况，“青学教育信息”不对用户的直接或间接损失承担法律责任：

1、不可抗力事件导致的服务中断或“青学教育信息”无法控制的原因所导致的用户损失，“青学信息技术”不承担任何责任。

2、用户使用本网站（包括链接到第三方网站或自第三方网站链接）而可能产生的计算机病毒、黑客入侵、系统失灵或功能紊乱等导致的用户损失，“青学教育信息”不承担任何责任。

3、由于用户将个人注册账号信息告知他人或与他人共享注册帐号，由此导致的任何风险或损失，由用户自行承担。

4、教师/教育机构与学生/家长间或与任何第三人间的违约行为、侵权责任等，由有关当事人自行承担法律责任。

5、如因系统维护或升级而需要暂停网络服务，“青学教育信息”将尽可能事先在本网站进行通知。


八、隐私声明

“青学教育信息”承诺将按照本隐私声明收集、使用和披露用户信息，除本声明另有规定外，不会在未经用户许可的情况下向第三方或公众披露用户信息：

1、用户信息的范围包括：用户注册的账户信息、用户上传的信息、“青学教育信息”自动接收的用户信息、“青学教育信息”通过合法方式收集的用户信息等。

2、用户信息的收集、使用和披露

为了给用户提供更优质的服务，“青学教育信息”保留收集用户cookie信息等权利，“青学教育信息”不会向第三方披露任何可能用以识别用户个人身份的信息。

只在如下情况下，“青学教育信息”会合法披露用户信息：

（1）经用户事先同意，向第三方披露。

（2）根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露。

（3）其他根据法律、法规或者政策应进行的披露。

3、用户信息的保护

（1）用户的账户均有安全保护功能，请妥善保管账户及密码信息。“青学教育信息”将通过服务器数据备份，确认技术上以实现安全的对用户密码进行加密等措施确保用户信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请用户注意在信息网络上不存在绝对的安全措施。

（2）除非经过用户同意，“青学教育信息”不允许任何用户、第三方通过“青学教育信息”收集、出售或者无偿传播用户信息。

（3） “青学教育信息”含有到其他网站的链接，“青学教育信息”不对那些网站的隐私保护措施负责。当用户登录那些网站时，请提高警惕，保护个人隐私。


九、法律适用与争议解决

1、本协议的履行与解释均适用中华人民共和国法律。

2、“青学教育信息”与用户之间的任何争议应友好协商解决，协商不成的，任一方有权将争议提交哈尔滨市香坊区人民法院法院诉讼解决。


十、本协议条款的修改权与可分性

1、为更好地提供服务并符合相关监管政策，“青学教育信息”有权及时修改本协议条款。请用户定期查阅本协议条款。“青学教育信息”会在网页上公布这些条款的修改通知。

2、本协议条款中任何一条被视为无效或因任何理由不可执行，不影响任何其余条款的有效性和可执行性。


十一、通知

“青学教育信息”将通过在本网站上发布通知或其他方式与用户进行联系。用户同意用网站发布通知方式接收所有协议、通知、披露和其他信息。


十二、协议生效

1、本协议自用户注册“青学教育信息”之日起生效。

2、“青学教育信息”在法律允许范围内对本协议拥有解释权。

</pre>
  </div>
</template>

<script>
  export default {
    name: 'clause'
  }
</script>

<style scoped>
  .clause {
    width: 100%;
    max-height: 500px;
    text-align: left;
    line-height: 2em;
    /*text-indent: 20px;*/
    letter-spacing: 2px;
    font-size: larger;
    border-radius: 5px;
    background-color: #eee;
    opacity: 0.7;
    overflow: scroll;
  }
</style>
